# Olivia Storaci
## Week 14: 04/21/2022
### Python - Pandas DataFrame - Mapping, Applying, and Grouping

In [1]:
import numpy as np

from pandas import Series, DataFrame
import pandas as pd

In [3]:
# Mapping
df = DataFrame({'city':['Alma','Brian Head','Fox Park','Lake Mary'],
               'altitude':[10355,9800,9062,8966]})
df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [6]:
st_map={'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming','Lake Mary': 'California'}

st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [7]:
type(st_map)

dict

In [8]:
df['state'] = df['city'].map(st_map)
df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [9]:
# Apply functions to the data set. Call predefined functions or create your own functions or use lambda
def meter(x):
    return x / 3.2808

In [10]:
df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [11]:
df['altitude']=df['altitude'].apply(meter)

In [12]:
df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [13]:
df['altitude']=df['altitude'].apply(lambda x: np.nan if x < 2800 else x)
df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park          NaN     Wyoming
3   Lake Mary          NaN  California

In [14]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
              index=['UT','OH','TX','OR'])
df

           b         d         e
UT  0.202517  0.344838 -0.499625
OH  1.540585  0.907219 -1.101697
TX  1.240409  1.829752  0.313580
OR  0.064074  0.071675  0.413506

In [17]:
def dif(x):
    return x.max() -x.min()

In [18]:
df.apply(dif)

b    1.476510
d    1.758077
e    1.515203
dtype: float64

In [19]:
df.apply(dif,axis=1)

UT    0.844463
OH    2.642281
TX    1.516172
OR    0.349432
dtype: float64

In [20]:
df

           b         d         e
UT  0.202517  0.344838 -0.499625
OH  1.540585  0.907219 -1.101697
TX  1.240409  1.829752  0.313580
OR  0.064074  0.071675  0.413506

In [21]:
df.apply(lambda x: x.max() - x.min())

b    1.476510
d    1.758077
e    1.515203
dtype: float64

In [22]:
df.apply(lambda x: x.max() - x.min(), axis=1)

UT    0.844463
OH    2.642281
TX    1.516172
OR    0.349432
dtype: float64

In [23]:
# Looking at the data in the original dataframe
df.apply(pd.value_counts)

             b    d    e
-1.101697  NaN  NaN  1.0
-0.499625  NaN  NaN  1.0
 0.064074  1.0  NaN  NaN
 0.071675  NaN  1.0  NaN
 0.202517  1.0  NaN  NaN
 0.313580  NaN  NaN  1.0
 0.344838  NaN  1.0  NaN
 0.413506  NaN  NaN  1.0
 0.907219  NaN  1.0  NaN
 1.240409  1.0  NaN  NaN
 1.540585  1.0  NaN  NaN
 1.829752  NaN  1.0  NaN

In [24]:
# Group By
df = DataFrame({'k1': ['a','a','b','b','c'],
               'k2': ['one','two','one','two','one'],
               'dataset1': np.random.randn(5),
               'dataset2': np.random.randn(5)})
df

  k1   k2  dataset1  dataset2
0  a  one  0.266269  0.730925
1  a  two  0.588888 -0.337319
2  b  one  0.368020 -0.522739
3  b  two -1.573998  0.622164
4  c  one -0.312864  1.973160

In [25]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [26]:
# Size of the key
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [27]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.427578  0.196803
b  -0.602989  0.049713
c  -0.312864  1.973160

In [28]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.266269  0.730925
1  a  two  0.588888 -0.337319
2  b  one  0.368020 -0.522739
3  b  two -1.573998  0.622164
4  c  one -0.312864  1.973160

In [29]:
df.groupby('k2').size()

k2
one    3
two    2
dtype: int64

In [30]:
df.groupby('k2').mean()

     dataset1  dataset2
k2
one  0.107142  0.727115
two -0.492555  0.142423

In [31]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [32]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one  0.266269  0.730925
   two  0.588888 -0.337319
b  one  0.368020 -0.522739
   two -1.573998  0.622164
c  one -0.312864  1.973160

In [33]:
df.groupby(['k1','k2']).sum()

        dataset1  dataset2
k1 k2
a  one  0.266269  0.730925
   two  0.588888 -0.337319
b  one  0.368020 -0.522739
   two -1.573998  0.622164
c  one -0.312864  1.973160

In [35]:
df.groupby('k1').sum()

    dataset1  dataset2
k1
a   0.855157  0.393607
b  -1.205978  0.099425
c  -0.312864  1.973160

In [37]:
# Apply groupby for dataset 1
df['dataset1'].groupby(df['k1']).mean()

k1
a    0.427578
b   -0.602989
c   -0.312864
Name: dataset1, dtype: float64

In [38]:
df['dataset1'].groupby(df['k1']).sum()

k1
a    0.855157
b   -1.205978
c   -0.312864
Name: dataset1, dtype: float64

In [39]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.266269  0.730925
1  a  two  0.588888 -0.337319
2  b  one  0.368020 -0.522739
3  b  two -1.573998  0.622164
4  c  one -0.312864  1.973160

In [40]:
df.groupby(df['k1']).mean()

    dataset1  dataset2
k1
a   0.427578  0.196803
b  -0.602989  0.049713
c  -0.312864  1.973160

In [43]:
group = df.groupby(['k1','k2'])
group.count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

group.sum()

In [44]:
group.sum()

        dataset1  dataset2
k1 k2
a  one  0.266269  0.730925
   two  0.588888 -0.337319
b  one  0.368020 -0.522739
   two -1.573998  0.622164
c  one -0.312864  1.973160

In [45]:
group.mean()

        dataset1  dataset2
k1 k2
a  one  0.266269  0.730925
   two  0.588888 -0.337319
b  one  0.368020 -0.522739
   two -1.573998  0.622164
c  one -0.312864  1.973160

In [46]:
group.count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [47]:
group = df.groupby(['k1','k2'])[['dataset1']]

In [48]:
group.count()

        dataset1
k1 k2
a  one         1
   two         1
b  one         1
   two         1
c  one         1

In [49]:
group.mean()

        dataset1
k1 k2
a  one  0.266269
   two  0.588888
b  one  0.368020
   two -1.573998
c  one -0.312864

In [50]:
group.sum()

        dataset1
k1 k2
a  one  0.266269
   two  0.588888
b  one  0.368020
   two -1.573998
c  one -0.312864

In [51]:
df.groupby(['k1','k2'])[['dataset1']].mean()

        dataset1
k1 k2
a  one  0.266269
   two  0.588888
b  one  0.368020
   two -1.573998
c  one -0.312864

In [53]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.266269  0.730925
1  a  two  0.588888 -0.337319
2  b  one  0.368020 -0.522739
3  b  two -1.573998  0.622164
4  c  one -0.312864  1.973160

In [54]:
df.dtypes

k1           object
k2           object
dataset1    float64
dataset2    float64
dtype: object